OpenFOAM-v1712/tutorials/incompressible/pimpleFoam/RAS/elipsekkLOmega/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions


runApplication blockMesh
runApplication transformPoints -scale '(1.6666 1 1)'

runApplication changeDictionary -instance system -dict system/changeDictionaryDict.X
runApplication mirrorMesh -overwrite
rm -f log.mirrorMesh
rm -f log.changeDictionary

runApplication changeDictionary -instance system -dict system/changeDictionaryDict.Y
runApplication mirrorMesh -overwrite

runApplication topoSet
runApplication createPatch -overwrite
runApplication $(getApplication)

#------------------------------------------------------------------------------
